#include<stdio.h>
//int main(void)
//{
//	int num = 10;
//	//00000000 00000000 000000000 00001010 - 原码
//	//00000000 00000000 000000000 00001010 - 反码
//	//00000000 00000000 000000000 00001010 - 补码
//	//内存中存的是补码
//	//运算使用的也是补码
//	int n = num << 1;//num总共只有32位
//	//移位规则：左边抛弃，右边补0
//	printf("%d\n", num);
//	printf("%d\n", n);
//	return 0;
//}


//右移：逻辑右移和算数右移
//逻辑右移：左边用0填充，右边丢弃
//算数右移：左边用原该值的符号位填充，右边丢弃
//具体哪种取决于编译器，常见的编译器上采用的都是算数右移
//int main(void)
//{
//	int num = 10;
//	//00000000 00000000 00000000 00001010 - -10的原码
//	//00000000 00000000 00000000 00001010 - 反码
//	//00000000 00000000 00000000 00001010 - -10的补码
//	int n = num >> 1;
//	printf("%d\n", num);
//	printf("%d\n", n);
//	return 0;
//}
//int main(void)
//{
//	int num = -10;
//	//10000000 00000000 00000000 00001010 - 原码
//	//11111111 11111111 11111111 11110101 - 反码
//	//11111111 11111111 11111111 11110110 - 补码
//	int n = num >> 2;
//	//移位后还是补码
//	//11111111 11111111 11111111 11111101
//	//10000000 00000000 00000000 00000010(符号位不变，其余按位取反)
//	//10000000 00000000 00000000 00000011(加1变为原码准备打印)
//	printf("%d\n", num);//-10
//	printf("%d\n", n);//-3
//	return 0;
//}
//int main(void)
//{
//	int a = 3;
//	int b = -5; 
//	int c = a & b;//按位与 - 对应的二进制位进行运算，只要有0则为0，两个同时为1，才为1
//	//00000000 00000000 00000000 00000011 - 3的原码
//	//00000000 00000000 00000000 00000011 - 3的反码
//	//00000000 00000000 00000000 00000011 - 3的补码
//
//	//10000000 00000000 00000000 00000101 - -5的原码
//	//11111111 11111111 11111111 11111010 - -5的反码
//	//11111111 11111111 11111111 11111011 - -5的补码
//
//	//00000000 00000000 00000000 00000011 - 3的补码
//	//11111111 11111111 11111111 11111011 - -5的补码
//	//00000000 00000000 00000000 00000011  补码/原码（正数）
//	printf("%d\n", c);
//	return 0;
//}
//int main(void)
//{
//	int a = 3;
//	int b = -5;
//	int c = a | b;//按位或 - 对应的二进制位进行运算，只要有1则为1，两个同时为0，才为0
//	//00000000 00000000 00000000 00000011 - 3的原码
//	//00000000 00000000 00000000 00000011 - 3的反码
//	//00000000 00000000 00000000 00000011 - 3的补码
//
//	//10000000 00000000 00000000 00000101 - -5的原码
//	//11111111 11111111 11111111 11111010 - -5的反码
//	//11111111 11111111 11111111 11111011 - -5的补码
//
//	//00000000 00000000 00000000 00000011 - 3的补码
//	//11111111 11111111 11111111 11111011 - -5的补码
//	//11111111 11111111 11111111 11111011 - 补码
//	//10000000 00000000 00000000 00000100 - 符号位不变，其他位按位取反
//	//10000000 00000000 00000000 00000101 - 加1，原码
//	printf("%d\n", c);
//	return 0;
//}

//int main(void)
//{
//	int a = 3;
//	int b = -5;
//	int c = a ^ b;//按位异或 - 对应的二进制位进行运算，相同为0，相异为1
//	//00000000 00000000 00000000 00000011 - 3的原码
//	//00000000 00000000 00000000 00000011 - 3的反码
//	//00000000 00000000 00000000 00000011 - 3的补码
//
//	//10000000 00000000 00000000 00000101 - -5的原码
//	//11111111 11111111 11111111 11111010 - -5的反码
//	//11111111 11111111 11111111 11111011 - -5的补码
//
//	//00000000 00000000 00000000 00000011 - 3的补码
//	//11111111 11111111 11111111 11111011 - -5的补码
//	//11111111 11111111 11111111 11111000   补码
//	//10000000 00000000 00000000 00000111   取反，加一（下边）
//	//10000000 00000000 00000000 00001000   原码
//	//-8
//	printf("%d\n", c);
//	return 0;
//}

//int main(void)
//{
//	int a = 0;
//	int b = ~a;
//	printf("a = %d\n", a);//按位取反，将补码的所有二进制位取反
//	printf("b = %d\n", b);
//	//00000000 00000000 00000000 00000000
//	//11111111 11111111 11111111 11111111 补码
//	//10000000 00000000 00000000 00000000 取反
//	//10000000 00000000 00000000 00000001 加一 --> -1
//	return 0;
//}

//int main(void)
//{
//	int a = 3;
//	int b = 5;
//	//写代码，将a和b的内容交换
//	int c = 0;
//	printf("交换前：a = %d b = %d", a, b);
//	//交换
//	c = a;
//	a = b;
//	b = c;
//	printf("交换后： a = %d b = %d", a, b);
//	return 0;
//}

//一道变态的面试题：要求不创建中间变量
//int main(void)
//{
//	int a = 3;
//	int b = 5;
//	//写代码，将a和b的内容交换
//	int c = 0;
//	printf("交换前：a = %d b = %d", a, b);
//	//交换
//	a = a + b;
//	b = a - b;//b得到原来的a
//	a = a - b;//得到原来的b
//	printf("交换后： a = %d b = %d", a, b);
//	return 0;
//}可能存在溢出风险
//int main(void)
//{
//	int a = 3;
//	int b = 5;
//	//写代码，将a和b的内容交换
//	int c = 0;
//	printf("交换前：a = %d b = %d", a, b);
//	//交换
//	a = a ^ b;
//	b = a ^ b;//b得到原来的a
//	a = a ^ b;//得到原来的b
//	printf("交换后： a = %d b = %d", a, b);
//	return 0;
//}//异或是支持交换律的

//int main(void)
//{
//	int a = 3;
//	int b = 5;
//	//写代码，将a和b的内容交换
//	int c = 0;
//	printf("交换前：a = %d b = %d", a, b);
//	//交换
//	a = a ^ b;//a' = a ^ b
//	b = a ^ b;//b = a' ^ b --> b = a ^ b ^ b --> b = a;
//	a = a ^ b;//a = a ^ b ^ a --> a = b
//	printf("交换后： a = %d b = %d", a, b);
//	return 0;
//}//异或是支持交换律的

//int main(void)
//{
//	int count = 0;
//	int n = -1;
//	int i = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if (((n >> i) & 1) == 1)//n是不变的
//		{
//			count++;
//		}
//	}
//	printf("%d\n", count);
//	return 0;
//}
//int main(void)
//{
//	int count = 0;
//	int n = 10;
//	int i = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if (((n >> i) & 1) == 1)//n是不变的
//		{
//			count++;
//		}
//	}
//	printf("%d\n", count);
//	return 0;
//}

//n = n & (n-1)  这个表达式会将n的二进制表示中最右边的1去掉
//在n变成0之前，这个表达式能执行几次，就说明n的二进制表示中有几个1
//新方法
//int main(void)
//{
//	int count = 0;
//	int n = -1;
//	while (n)
//	{
//		count++;
//		n = n & (n - 1);
//	}
//	printf("%d\n", count);
//	return 0;
//}
//写个代码判断n是否是2的幂次方数？
//2          4            8          16          32
//0010     0100         1000       10000      00100000
//n的二进制中只有1个1，就是2的幂次方
//if((n & (n-1))==0)

//编写代码将13二进制序列的第五位修改为1，然后再改回0
//int main(void)
//{
//	int count = 0;
//	int n = 13;
//	n |= (1 << 4);
//	printf("%d\n", n);//29
//	n &= ~(i << 4);
//	printf("%d\n", n);//13
//	return 0;
//}

//逗号表达式，从左向右依次执行，整个表达式的结果是最后一个表达式的结果